In [2]:
import numpy as np
import pandas as pd

In [3]:
#Data Frame
data={"Name":["Rishi","Ram","PM","Rejoy","Raj","Vaibhav"],"Age":[21,30,20,23,21,22],"City":["Pune","Mumbai","Satara","MP","Pune"
                                                                                            ,"Bhusaval"]}
df=pd.DataFrame(data)
print(df) 
print("")
print(df.head(3)) #By default 5 element
print("")
print(df.tail(3))
print("")
print(df[["Name"]]) #Retriving any column from data frame

      Name  Age      City
0    Rishi   21      Pune
1      Ram   30    Mumbai
2       PM   20    Satara
3    Rejoy   23        MP
4      Raj   21      Pune
5  Vaibhav   22  Bhusaval

    Name  Age    City
0  Rishi   21    Pune
1    Ram   30  Mumbai
2     PM   20  Satara

      Name  Age      City
3    Rejoy   23        MP
4      Raj   21      Pune
5  Vaibhav   22  Bhusaval

      Name
0    Rishi
1      Ram
2       PM
3    Rejoy
4      Raj
5  Vaibhav

In [4]:
#To add new column
s=pd.Series([10,20,30,40,50])
df=pd.DataFrame(s)
df.columns=["List1"]
df["List2"]=20
df["List3"]=df["List1"]+df["List2"]
print(df)

   List1  List2  List3
0     10     20     30
1     20     20     40
2     30     20     50
3     40     20     60
4     50     20     70

In [5]:
#To add a column i dataframe
data={"Name":["Rishi","Ram","PM","Rejoy","Raj","Vaibhav"],
      "Age":[21,30,20,23,21,22],
      "City":["Pune","Mumbai","Satara","MP","Pune","Bhusaval"]}
df=pd.DataFrame(data)
print(df) 

df["Internal"]=[20,40,30,45,50,30]
df["External"]=[40,70,80,100,60,80]
df["Total || 150"]=df["Internal"]+df["External"]
df

      Name  Age      City
0    Rishi   21      Pune
1      Ram   30    Mumbai
2       PM   20    Satara
3    Rejoy   23        MP
4      Raj   21      Pune
5  Vaibhav   22  Bhusaval

      Name  Age      City  Internal  External  Total || 150
0    Rishi   21      Pune        20        40            60
1      Ram   30    Mumbai        40        70           110
2       PM   20    Satara        30        80           110
3    Rejoy   23        MP        45       100           145
4      Raj   21      Pune        50        60           110
5  Vaibhav   22  Bhusaval        30        80           110

In [3]:
#Delete a column from dataframe
#1.del
df.del["List3"]
df

SyntaxError: invalid syntax (3255076819.py, line 3)

In [ ]:
#2.pop()
df.pop("List2")
df

In [ ]:
#3.drop()
s=pd.Series([10,20,30,40])
df=pd.DataFrame(s)
df.columns=["List1"]
df["List2"]=40
df1=df.drop("List2",axis=1)
df2=df.drop(index=[2,3],axis=0)
print("")
print(df)
print("")
print(df1)
print("")
print(df2)

In [12]:
#Loc method - Location for column and row
Runs={"TCS":{"Qtr1":2000,"Qtr2":3000,"Qtr3":4000,"Qtr4":5000},
     "WIPRO":{"Qtr1":2000,"Qtr2":3000,"Qtr3":4000,"Qtr4":5000},
     "L&T":{"Qtr1":2000,"Qtr2":3000,"Qtr3":4000,"Qtr4":5000}}
df=pd.DataFrame(Runs)
print(df)
print("")
print(df.loc["Qtr1",:])
print("")
print(df.loc["Qtr1":"Qtr3"])
print("")
print(df.loc["Qtr2","WIPRO"])
print("")
print(df.loc[:,"TCS"])
print(df.loc[:,"TCS":"WIPRO"])
df

       TCS  WIPRO   L&T
Qtr1  2000   2000  2000
Qtr2  3000   3000  3000
Qtr3  4000   4000  4000
Qtr4  5000   5000  5000

TCS      2000
WIPRO    2000
L&T      2000
Name: Qtr1, dtype: int64

       TCS  WIPRO   L&T
Qtr1  2000   2000  2000
Qtr2  3000   3000  3000
Qtr3  4000   4000  4000

3000

Qtr1    2000
Qtr2    3000
Qtr3    4000
Qtr4    5000
Name: TCS, dtype: int64
       TCS  WIPRO
Qtr1  2000   2000
Qtr2  3000   3000
Qtr3  4000   4000
Qtr4  5000   5000

       TCS  WIPRO   L&T
Qtr1  2000   2000  2000
Qtr2  3000   3000  3000
Qtr3  4000   4000  4000
Qtr4  5000   5000  5000

In [ ]:
#13-03-2024

In [7]:
# 3rd col and 3rd row
print(df.iloc[2:3,2:3])
print("")
print(df)

     City
2  Satara

      Name  Age      City  Internal  External  Total || 150
0    Rishi   21      Pune        20        40            60
1      Ram   30    Mumbai        40        70           110
2       PM   20    Satara        30        80           110
3    Rejoy   23        MP        45       100           145
4      Raj   21      Pune        50        60           110
5  Vaibhav   22  Bhusaval        30        80           110

In [8]:
# last 2 rows
print(df.iloc[2:,:])

       TCS  WIPRO   L&T
Qtr3  4000   4000  4000
Qtr4  5000   5000  5000

In [9]:
print(df.head(2))
print(df.tail(2))

       TCS  WIPRO   L&T
Qtr1  2000   2000  2000
Qtr2  3000   3000  3000
       TCS  WIPRO   L&T
Qtr3  4000   4000  4000
Qtr4  5000   5000  5000

In [10]:
# boolean index
dic={
    'Name':['rachin','sachin','mahi','rohit','virat'],
    'Age':[22,45,39,36,35]
}
df=pd.DataFrame(dic,index=[True,False,True,False,True])
print(df)
print(df.loc[True],"\n")
print(df.iloc[4])

         Name  Age
True   rachin   22
False  sachin   45
True     mahi   39
False   rohit   36
True    virat   35
        Name  Age
True  rachin   22
True    mahi   39
True   virat   35

Name    virat
Age        35
Name: True, dtype: object

In [12]:
# concat two dataFrames
dict1={'id':['1','2','3','4','5'],'value1':['A','C','E','G','I'],'value2':['B','D','F','H','J']}
dict2={'id':['2','3','6','7','8'],'value1':['K','M','O','Q','S'],'value2':['L','N','P','R','T']}
df1=pd.DataFrame(dict1)
df2=pd.DataFrame(dict2)
df3=pd.concat([df1,df2])
print(df3)
# automatically dosen't increment index value

  id value1 value2
0  1      A      B
1  2      C      D
2  3      E      F
3  4      G      H
4  5      I      J
0  2      K      L
1  3      M      N
2  6      O      P
3  7      Q      R
4  8      S      T

In [13]:
print(df1)

  id value1 value2
0  1      A      B
1  2      C      D
2  3      E      F
3  4      G      H
4  5      I      J

In [14]:
print(df2)

  id value1 value2
0  2      K      L
1  3      M      N
2  6      O      P
3  7      Q      R
4  8      S      T

In [15]:
# automatically increment index value i.e 0.......9 or end index using ignore_index
df3=pd.concat([df1,df2],ignore_index=True)
print(df3)

  id value1 value2
0  1      A      B
1  2      C      D
2  3      E      F
3  4      G      H
4  5      I      J
5  2      K      L
6  3      M      N
7  6      O      P
8  7      Q      R
9  8      S      T

In [16]:
# axis=1 for column
df3=pd.concat([df1,df2],axis=1)
print(df3)

  id value1 value2 id value1 value2
0  1      A      B  2      K      L
1  2      C      D  3      M      N
2  3      E      F  6      O      P
3  4      G      H  7      Q      R
4  5      I      J  8      S      T

In [17]:
# axis=0 for rows
df3=pd.concat([df1,df2],axis=0)
print(df3)

  id value1 value2
0  1      A      B
1  2      C      D
2  3      E      F
3  4      G      H
4  5      I      J
0  2      K      L
1  3      M      N
2  6      O      P
3  7      Q      R
4  8      S      T

In [18]:
merge={'Data1':df1,'Data2':df2}
df3=pd.concat(merge)
print(df3)

        id value1 value2
Data1 0  1      A      B
      1  2      C      D
      2  3      E      F
      3  4      G      H
      4  5      I      J
Data2 0  2      K      L
      1  3      M      N
      2  6      O      P
      3  7      Q      R
      4  8      S      T

In [19]:
# merge operation on dataframe
dic1={'id':['1','2','3','4','5'],'value1':['A','C','E','G','I'],'value2':['B','D','F','H','J']}
dic2={'id':['2','3','6','7','8'],'value1':['K','M','O','Q','S'],'value2':['L','N','P','R','T']}
dic3={'id':['1','2','3','4','5','7','8','9','10','11'],'value3':[12,13,14,15,16,17,15,12,13,23]}
df1=pd.DataFrame(dic1)
df2=pd.DataFrame(dic2)
df3=pd.concat([df1,df2])
df4=pd.DataFrame(dic3)
df5=pd.merge(df3,df4,on="id")
print(df5)

  id value1 value2  value3
0  1      A      B      12
1  2      C      D      13
2  2      K      L      13
3  3      E      F      14
4  3      M      N      14
5  4      G      H      15
6  5      I      J      16
7  7      Q      R      17
8  8      S      T      15

In [20]:
# union  = outer
df5=pd.merge(df1,df2,on="id",how='outer')
print(df5)

  id value1_x value2_x value1_y value2_y
0  1        A        B      NaN      NaN
1  2        C        D        K        L
2  3        E        F        M        N
3  4        G        H      NaN      NaN
4  5        I        J      NaN      NaN
5  6      NaN      NaN        O        P
6  7      NaN      NaN        Q        R
7  8      NaN      NaN        S        T

In [21]:
df5=pd.merge(df1,df2,left_on="id",right_on="id",how='outer',suffixes=('_left','_right'))
print(df5)

  id value1_left value2_left value1_right value2_right
0  1           A           B          NaN          NaN
1  2           C           D            K            L
2  3           E           F            M            N
3  4           G           H          NaN          NaN
4  5           I           J          NaN          NaN
5  6         NaN         NaN            O            P
6  7         NaN         NaN            Q            R
7  8         NaN         NaN            S            T

In [22]:
# intersection = inner
df5=pd.merge(df1,df2,on="id",how='inner')
print(df5)

  id value1_x value2_x value1_y value2_y
0  2        C        D        K        L
1  3        E        F        M        N

In [23]:
# right join
df5=pd.merge(df1,df2,on="id",how='right')
print(df5)

  id value1_x value2_x value1_y value2_y
0  2        C        D        K        L
1  3        E        F        M        N
2  6      NaN      NaN        O        P
3  7      NaN      NaN        Q        R
4  8      NaN      NaN        S        T

In [24]:
# left join
df5=pd.merge(df1,df2,on="id",how='left')
print(df5)

  id value1_x value2_x value1_y value2_y
0  1        A        B      NaN      NaN
1  2        C        D        K        L
2  3        E        F        M        N
3  4        G        H      NaN      NaN
4  5        I        J      NaN      NaN

In [25]:
# joining index
df5=pd.merge(df1,df2,left_index=True,right_index=True)
df5

  id_x value1_x value2_x id_y value1_y value2_y
0    1        A        B    2        K        L
1    2        C        D    3        M        N
2    3        E        F    6        O        P
3    4        G        H    7        Q        R
4    5        I        J    8        S        T

In [30]:
# csv
df=pd.read_csv("Book1.csv")
df

   Sr. No.  Emp_ID E_Name       D-O-B
0        1     101  Rishi  21/08/2002
1        2     102    Ram  07/07/2000
2        3     103     PM  20/03/2003
3        4     104  Rejoy  15/01/2001
4        5     105  Kamal  12/12/2001

In [31]:
# dataframe to csv
runs={
    'TCS':{"qty1":6500,"qty2":2000,"qty3":3000,"qty4":30000},
    'Wipro':{"qty1":5500,"qty2":1000,"qty3":4000,"qty4":40000},
    'l&T':{"qty1":4500,"qty2":3000,"qty3":5000,"qty4":50000},
}
df1=pd.DataFrame(runs)
df1.to_csv("Book2.csv")

In [32]:
df=pd.read_csv("Book1.csv")
df

   Sr. No.  Emp_ID E_Name       D-O-B
0        1     101  Rishi  21/08/2002
1        2     102    Ram  07/07/2000
2        3     103     PM  20/03/2003
3        4     104  Rejoy  15/01/2001
4        5     105  Kamal  12/12/2001

In [34]:
print(df.head(2),"\n")
print(df.tail(2))

   Sr. No.  Emp_ID E_Name       D-O-B
0        1     101  Rishi  21/08/2002
1        2     102    Ram  07/07/2000

   Sr. No.  Emp_ID E_Name       D-O-B
3        4     104  Rejoy  15/01/2001
4        5     105  Kamal  12/12/2001

In [8]:
#14-03-2024

In [15]:
#Loc method - Location for column and row
Runs={"TCS":{"Qtr1":2000,"Qtr2":3000,"Qtr3":4000,"Qtr4":5000},
     "WIPRO":{"Qtr1":2000,"Qtr2":3000,"Qtr3":4000,"Qtr4":5000},
     "L&T":{"Qtr1":2000,"Qtr2":3000,"Qtr3":4000,"Qtr4":5000}}
df=pd.DataFrame(Runs)
print(df)

       TCS  WIPRO   L&T
Qtr1  2000   2000  2000
Qtr2  3000   3000  3000
Qtr3  4000   4000  4000
Qtr4  5000   5000  5000

In [19]:
#max
print(df['WIPRO'].max())
print("")
print(df.max(axis=0))
print("")
print(df.max(axis=1))

5000

TCS      5000
WIPRO    5000
L&T      5000
dtype: int64

Qtr1    2000
Qtr2    3000
Qtr3    4000
Qtr4    5000
dtype: int64

In [20]:
#min
print(df['WIPRO'].min())
print("")
print(df.min(axis=0))
print("")
print(df.min(axis=1))

2000

TCS      2000
WIPRO    2000
L&T      2000
dtype: int64

Qtr1    2000
Qtr2    3000
Qtr3    4000
Qtr4    5000
dtype: int64

In [23]:
#mean
print(df['WIPRO'].mean())
print("")
print(df.mean(axis=0))
print("")
print(df.mean(axis=1))

3500.0

TCS      3500.0
WIPRO    3500.0
L&T      3500.0
dtype: float64

Qtr1    2000.0
Qtr2    3000.0
Qtr3    4000.0
Qtr4    5000.0
dtype: float64

In [24]:
#median
print(df['WIPRO'].median())
print("")
print(df.median(axis=0))
print("")
print(df.median(axis=1))

3500.0

TCS      3500.0
WIPRO    3500.0
L&T      3500.0
dtype: float64

Qtr1    2000.0
Qtr2    3000.0
Qtr3    4000.0
Qtr4    5000.0
dtype: float64

In [25]:
#mode
print(df['WIPRO'].mode())
print("")
print(df.mode(axis=0))
print("")
print(df.mode(axis=1))

0    2000
1    3000
2    4000
3    5000
Name: WIPRO, dtype: int64

    TCS  WIPRO   L&T
0  2000   2000  2000
1  3000   3000  3000
2  4000   4000  4000
3  5000   5000  5000

         0
Qtr1  2000
Qtr2  3000
Qtr3  4000
Qtr4  5000

In [26]:
#sum
print(df['WIPRO'].sum())
print("")
print(df.sum(axis=0))
print("")
print(df.sum(axis=1))

14000

TCS      14000
WIPRO    14000
L&T      14000
dtype: int64

Qtr1     6000
Qtr2     9000
Qtr3    12000
Qtr4    15000
dtype: int64

In [27]:
#unique
print(df['WIPRO'].unique())

[2000 3000 4000 5000]

In [28]:
#nunique
print(df['WIPRO'].nunique())

4

In [29]:
#count
print(df['WIPRO'].count())

4

In [32]:
#value_counts
print(df['WIPRO'].value_counts())

WIPRO
2000    1
3000    1
4000    1
5000    1
Name: count, dtype: int64

In [33]:
#length
len(df)

4

In [34]:
#sort_values
print(df['WIPRO'].sort_values())

Qtr1    2000
Qtr2    3000
Qtr3    4000
Qtr4    5000
Name: WIPRO, dtype: int64

In [35]:
#isnull
print(df['WIPRO'].isnull())

Qtr1    False
Qtr2    False
Qtr3    False
Qtr4    False
Name: WIPRO, dtype: bool

In [36]:
#To use function
def times2(x):
    return x*2
df['WIPRO'].apply(times2)

Qtr1     4000
Qtr2     6000
Qtr3     8000
Qtr4    10000
Name: WIPRO, dtype: int64

In [37]:
#Lambda
df['WIPRO'].apply(lambda x:x*2)

Qtr1     4000
Qtr2     6000
Qtr3     8000
Qtr4    10000
Name: WIPRO, dtype: int64

In [ ]:
#GroupBy
df.groupby('Company')
byComp=df.groupby('Company')
byComp.sum()